[
    {
        "id": "metro-mapper",
        "name": "Metro Mapper",
        "tagline": "Simple tool for creating simple metro maps.",
        "publishedYear": 2025,
        "publishedMonth": 3,
        "shortDescription": "Metro Mapper is a tool for easily creating simple metro maps. It will automatically arrange stations and lines such that there are no overlaps (does not always work) and stations are equally distant from each other on the same stretch. Metro Mapper is still in development. It is made using C++ and SDL. A web version was compiled using Emscripten, which can be tried out on itch.io.",
        "description": "Metro Mapper is a tool for easily creating simple metro maps. It will automatically arrange stations and lines such that there are no overlaps (does not always work) and stations are equally distant from each other on the same stretch. Metro Mapper is still in development. It is made using C++ and SDL. A web version was compiled using Emscripten, which can be tried out on itch.io.",
        "media": [
            "/media/projects/metro-mapper/screenshot.jpg"
        ],
        "technologies": [
            "cpp",
            "sdl2",
            "emscripten"
        ],
        "links": {
            "github": "https://github.com/caheuer/metro-mapper",
            "itchio": "https://chrisausdemklo.itch.io/metro-mapper"
        }
    },
    {
        "id": "portfolio",
        "name": "This Website",
        "tagline": "The website you are currently looking at.",
        "publishedYear": 2025,
        "publishedMonth": 0,
        "shortDescription": "The website you are currently looking at. It is a React app with server-side rendering based on the Vite TypeScript React SSR template. It is hosted on my own server using Docker. The code is automatically updated from GitHub using a GitHub action that deploys the image to GitHub Container Registry and Watchtower on the server.",
        "description": "The website you are currently looking at. It is a React app with server-side rendering based on the Vite TypeScript React SSR template.",
        "media": [
            "/media/projects/portfolio/portfolio.png"
        ],
        "technologies": [
            "react",
            "typescript",
            "docker"
        ],
        "links": {
            "github": "https://github.com/caheuer/caheuer-portfolio"
        }
    },
    {
        "id": "elgio",
        "name": "ELGIO",
        "tagline": "Event discovery platform with ticketing service.",
        "publishedYear": 2021,
        "publishedMonth": 8,
        "shortDescription": "ELGIO is an event discovery platform with its own ticketing service that I built together with two friends. It consists of a web app and a dashboard written in React. It once had a now deprecated mobile app for users and has one ticket scanning app. Both were written in Flutter. The backend uses different Firebase services for authentication, storage, serverless functions and database. A scraper written in Python using BeautifulSoup and Selenium is used to get event data from different sources.",
        "description": "ELGIO is a platform that connects freelancers with clients. It is a platform that is designed to be the future of work. It is a platform that is designed to be the future of work. It is a platform that is designed to be the future of work. It is a platform that is designed to be the future of work.",
        "media": [
            "/media/projects/elgio/elgio-webapp.png"
        ],
        "technologies": [
            "react",
            "firebase",
            "flutter",
            "javascript",
            "python"
        ],
        "links": {
            "website": "https://elgio.de"
        }
    }
]